# Homebrew Brewfile
# Usage: brew bundle --file=./macOS/Brewfile

# Taps
tap "homebrew/bundle"

# Core utilities
brew "coreutils"
brew "moreutils"
brew "findutils"

# Command-line tools
brew "awscli"
brew "bash"
brew "bitwarden-cli"
brew "brew-php-switcher"
brew "bun"
brew "cowsay"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "gitleaks"
brew "gnupg"
brew "go"
brew "imagemagick"
brew "jq"
brew "k6"
brew "mise"
brew "mkcert"
brew "ollama"
brew "openjdk"
brew "php"
brew "pinentry-mac"
brew "podman"
brew "poppler"
brew "ripgrep"
brew "rust"
brew "sevenzip"
brew "sqlite"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "volta"
brew "wget"
brew "yazi"
brew "yq"
brew "zoxide"

# GUI Applications
cask "bitwarden"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "ddpm"
cask "discord"
cask "figma"
cask "firefox"
cask "gemini"
cask "ghostty"
cask "github"
cask "google-chat"
cask "google-chrome"
cask "google-drive"
cask "docker-desktop"
cask "hhkb"
cask "iterm2"
cask "jetbrains-toolbox"
cask "mattermost"
cask "microsoft-edge"
cask "microsoft-office"
cask "postman"
cask "rancher"
cask "raycast"
cask "slack"
cask "steam"
cask "thunderbird"
cask "visual-studio-code"
cask "warp"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "zoom"

# Fonts
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
